Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.1.45/edc/PIC32MZ2048EFM124.PIC
      <edc:SFRDef edc:_addr="0x1F810230" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC15" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC15" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD1IS" edc:desc="" edc:mask="0x3" edc:name="ADCD1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD1IP" edc:desc="" edc:mask="0x7" edc:name="ADCD1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD2IS" edc:desc="" edc:mask="0x3" edc:name="ADCD2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD2IP" edc:desc="" edc:mask="0x7" edc:name="ADCD2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD3IS" edc:desc="" edc:mask="0x3" edc:name="ADCD3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD3IP" edc:desc="" edc:mask="0x7" edc:name="ADCD3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD4IS" edc:desc="" edc:mask="0x3" edc:name="ADCD4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD4IP" edc:desc="" edc:mask="0x7" edc:name="ADCD4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810240" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC16" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC16" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD5IS" edc:desc="" edc:mask="0x3" edc:name="ADCD5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD5IP" edc:desc="" edc:mask="0x7" edc:name="ADCD5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD6IS" edc:desc="" edc:mask="0x3" edc:name="ADCD6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD6IP" edc:desc="" edc:mask="0x7" edc:name="ADCD6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD7IS" edc:desc="" edc:mask="0x3" edc:name="ADCD7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD7IP" edc:desc="" edc:mask="0x7" edc:name="ADCD7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD8IS" edc:desc="" edc:mask="0x3" edc:name="ADCD8IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD8IP" edc:desc="" edc:mask="0x7" edc:name="ADCD8IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810250" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC17" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC17" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD9IS" edc:desc="" edc:mask="0x3" edc:name="ADCD9IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD9IP" edc:desc="" edc:mask="0x7" edc:name="ADCD9IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD10IS" edc:desc="" edc:mask="0x3" edc:name="ADCD10IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD10IP" edc:desc="" edc:mask="0x7" edc:name="ADCD10IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD11IS" edc:desc="" edc:mask="0x3" edc:name="ADCD11IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD11IP" edc:desc="" edc:mask="0x7" edc:name="ADCD11IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD12IS" edc:desc="" edc:mask="0x3" edc:name="ADCD12IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD12IP" edc:desc="" edc:mask="0x7" edc:name="ADCD12IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810260" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC18" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC18" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD13IS" edc:desc="" edc:mask="0x3" edc:name="ADCD13IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD13IP" edc:desc="" edc:mask="0x7" edc:name="ADCD13IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD14IS" edc:desc="" edc:mask="0x3" edc:name="ADCD14IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD14IP" edc:desc="" edc:mask="0x7" edc:name="ADCD14IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD15IS" edc:desc="" edc:mask="0x3" edc:name="ADCD15IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD15IP" edc:desc="" edc:mask="0x7" edc:name="ADCD15IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD16IS" edc:desc="" edc:mask="0x3" edc:name="ADCD16IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD16IP" edc:desc="" edc:mask="0x7" edc:name="ADCD16IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
