Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.1.45/edc/PIC32MZ2048EFM124.PIC
      <edc:AdjustPoint edc:_addr="0x1F8E3320" edc:offset="32"/>
      <edc:SFRDef edc:_addr="0x1F8E3340" edc:_begin="0x340" edc:_end="0x34c" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="16" edc:access="--------nnnnnnn---------nnnnnnn-" edc:cname="USBDPBFD" edc:desc="" edc:impl="0xfe00fe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------0000000---------0000000-" edc:name="USBDPBFD" edc:nzwidth="32" edc:por="--------0000000---------0000000-" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EP1RXD" edc:desc="" edc:mask="0x1" edc:name="EP1RXD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP2RXD" edc:desc="" edc:mask="0x1" edc:name="EP2RXD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP3RXD" edc:desc="" edc:mask="0x1" edc:name="EP3RXD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP4RXD" edc:desc="" edc:mask="0x1" edc:name="EP4RXD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP5RXD" edc:desc="" edc:mask="0x1" edc:name="EP5RXD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP6RXD" edc:desc="" edc:mask="0x1" edc:name="EP6RXD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP7RXD" edc:desc="" edc:mask="0x1" edc:name="EP7RXD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="EP1TXD" edc:desc="" edc:mask="0x1" edc:name="EP1TXD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP2TXD" edc:desc="" edc:mask="0x1" edc:name="EP2TXD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP3TXD" edc:desc="" edc:mask="0x1" edc:name="EP3TXD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP4TXD" edc:desc="" edc:mask="0x1" edc:name="EP4TXD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP5TXD" edc:desc="" edc:mask="0x1" edc:name="EP5TXD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP6TXD" edc:desc="" edc:mask="0x1" edc:name="EP6TXD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP7TXD" edc:desc="" edc:mask="0x1" edc:name="EP7TXD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3344" edc:_begin="0x340" edc:_end="0x34c" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="16" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBTMCON1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="USBTMCON1" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TUCH" edc:desc="" edc:mask="0xffff" edc:name="TUCH" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="THHSRTN" edc:desc="" edc:mask="0xffff" edc:name="THHSRTN" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3348" edc:_begin="0x340" edc:_end="0x34c" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="16" edc:access="----------------------------nnnn" edc:cname="USBTMCON2" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="USBTMCON2" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="THSBT" edc:desc="" edc:mask="0xf" edc:name="THSBT" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E334C" edc:offset="20"/>
      <edc:SFRDef edc:_addr="0x1F8E3360" edc:_begin="0x360" edc:_end="0x368" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="17" edc:access="--nnnnnn---nnnnnnnnn---nnnnnnnnn" edc:cname="USBLPMR1" edc:desc="" edc:impl="0x3f1ff1ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000---000000000---000000000" edc:name="USBLPMR1" edc:nzwidth="32" edc:por="--000000---000000000---000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LNKSTATE" edc:desc="" edc:mask="0xf" edc:name="LNKSTATE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="HIRD" edc:desc="" edc:mask="0xf" edc:name="HIRD" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="RMTWAK" edc:desc="" edc:mask="0x1" edc:name="RMTWAK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ENDPOINT" edc:desc="" edc:mask="0xf" edc:name="ENDPOINT" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="LPMXMT" edc:desc="" edc:mask="0x1" edc:name="LPMXMT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LPMRES" edc:desc="" edc:mask="0x1" edc:name="LPMRES" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LPMEN" edc:desc="" edc:mask="0x3" edc:name="LPMEN" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="LPMNAK" edc:desc="" edc:mask="0x1" edc:name="LPMNAK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="LPMTOIE" edc:desc="" edc:mask="0x1" edc:name="LPMTOIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LPMSTIE" edc:desc="" edc:mask="0x1" edc:name="LPMSTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LPMNYIE" edc:desc="" edc:mask="0x1" edc:name="LPMNYIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LPMACKIE" edc:desc="" edc:mask="0x1" edc:name="LPMACKIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LPMRESIE" edc:desc="" edc:mask="0x1" edc:name="LPMRESIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LPMERRIE" edc:desc="" edc:mask="0x1" edc:name="LPMERRIE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
